mysql/mysql实战45讲.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL实战45讲笔记</title>
<meta name="generator" content="Org mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">MySQL实战45讲笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge788cae">准备</a></li>
<li><a href="#orgcae3b18">开篇词</a></li>
<li><a href="#org9918830">基础架构：查询语句执行流程</a></li>
<li><a href="#org9284661">日志系统：更新语句执行流程</a></li>
<li><a href="#orgc642176">事务隔离</a></li>
<li><a href="#org032edbc">深入浅出索引（上）</a></li>
<li><a href="#org5a260d8">深入浅出索引（下）</a></li>
<li><a href="#org12e7345">全局锁和表锁</a></li>
<li><a href="#org421ce5c">行锁功过：怎么减少行锁对性能的影响</a></li>
<li><a href="#orga39e1f0">事务到底是隔离的还是不隔离的？</a></li>
<li><a href="#orgfd954d0">普通索引和唯一索引，应该怎么选择</a></li>
<li><a href="#org90f60cc">mysql 为什么有时候会选错索引</a></li>
<li><a href="#orgeb4fa36">怎么给字符串字段加索引</a></li>
<li><a href="#org419167d">为什么我的 mysql 会抖一下</a></li>
<li><a href="#orgcebfc33">为什么表数据删掉一半，表文件大小不变</a></li>
<li><a href="#org3c97d28">count(*)这么慢，我该怎么办</a></li>
<li><a href="#org214c4bf">答疑文章（一）：日志和索引相关问题</a></li>
<li><a href="#org39a00d5">order by 是怎么工作的</a></li>
<li><a href="#org481b3ea">如何正确的显示随机消息</a></li>
<li><a href="#org4dcd172">为什么这些 sql 语句逻辑相同，性能却差异巨大？</a></li>
<li><a href="#org23be924">为什么我只查一行的语句，也执行这么慢</a></li>
<li><a href="#orge1e10af">幻读是什么，幻读有什么问题</a></li>
<li><a href="#org7e57275">mysql 有哪些“饮鸩止渴”提高性能的方法</a></li>
<li><a href="#org1acbf95">mysql 是怎么保证数据不丢的</a></li>
<li><a href="#org5526be8">mysql 是怎么保证主备一致的</a></li>
<li><a href="#orge8b60a8">mysql 是怎么保证高可用的</a></li>
<li><a href="#org46dbae2">备库为什么会延迟好几个小时</a></li>
<li><a href="#org2168a86">主库出问题了，从库怎么办？</a></li>
<li><a href="#org2f98d61">读写分离哟那些坑</a></li>
<li><a href="#orgc981b72">如何判断一个数据库是不是出问题了</a></li>
<li><a href="#org3b228af">答疑文章（二）：用动态的观点看加锁</a></li>
<li><a href="#org25e55c6">误删数据后除了跑路还能怎么办？</a></li>
<li><a href="#orga589e88">为什么还有 kill 不掉的语句</a></li>
<li><a href="#orgcc6e290">我查了这么多数据会不会把数据库内存打爆</a></li>
<li><a href="#org938aa36">到底可不可以使用 join</a></li>
<li><a href="#orgf8ce9db">join 语句如何优化。</a></li>
<li><a href="#orgfd22144">为什么临时表可以重名</a></li>
<li><a href="#orgc81829a">什么时候会使用内部临时表</a></li>
<li><a href="#org4faf949">都说 InnoDB 好，那还要不要使用 Memory 引擎</a></li>
<li><a href="#orgfc30ba3">自增主键为什么不是连续的</a></li>
<li><a href="#orgad96f0b">insert 语句的锁为什么这么多</a></li>
<li><a href="#orgabfcfe5">怎么最快的赋值一张表</a></li>
<li><a href="#orgcb95bc6">grant 之后为什么要跟着 flush privilege</a></li>
<li><a href="#org5f1669e">要不要使用分区表</a></li>
<li><a href="#org0259050">答疑文章（三）说一说这些好问题</a></li>
<li><a href="#orgb3ae6ab">自增 ID 用完了怎么办</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge788cae" class="outline-2">
<h2 id="orge788cae">准备</h2>
<div class="outline-text-2" id="text-orge788cae">
<p>
使用 docker 搭建测试环境。
</p>
<div class="org-src-container">
<pre class="src src-sh">docker pull mysql:5.7
docker network create test
docker run -d --network test --restart always --name mysql-test -e <span style="color: #ff8700;">MYSQL_ROOT_PASSWORD</span>=test mysql:5.7
</pre>
</div>

<p>
连接 mysql
</p>
<div class="org-src-container">
<pre class="src src-sh">docker run -it --network test mysql:5.7 mysql -h mysql-test -p
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcae3b18" class="outline-2">
<h2 id="orgcae3b18">开篇词</h2>
</div>

<div id="outline-container-org9918830" class="outline-2">
<h2 id="org9918830">基础架构：查询语句执行流程</h2>
<div class="outline-text-2" id="text-org9918830">
<ul class="org-ul">
<li>server 层，涵盖 mysql 大多数核心服务功能，以及所有内置函数，所有跨存储引擎的功能都在这一层实现，比如存储过程、触发器、视图等。
<ul class="org-ul">
<li>连接器
<ul class="org-ul">
<li>建立链接
<ul class="org-ul">
<li>长连接问题：
<ul class="org-ul">
<li>原因：执行过程中临时使用的内存是在 链接对象中的。</li>
<li>解决办法：mysql_reset_connection 初始化连接资源。</li>
</ul></li>
</ul></li>
<li>身份验证
<ul class="org-ul">
<li>show processlist</li>
</ul></li>
<li>查询权限
<ul class="org-ul">
<li>去系统表读取数据，结果放在变量，执行器从该变量中读取。</li>
</ul></li>

<li>查询缓存
<ul class="org-ul">
<li>不要使用。</li>
<li>query_cache_type 设置为 DEMAND，按需使用。</li>
<li>select SQL_CACHE * from T where ID=10;</li>
<li>8.0 删除了该功能。</li>
</ul></li>
</ul></li>

<li>分析器
<ul class="org-ul">
<li>词法分析：识别查询语句中数据库名、表名、列名等。</li>
<li>语法分析</li>
</ul></li>

<li>优化器
<ul class="org-ul">
<li>决定使用的索引、表的连接（join）顺序。</li>
</ul></li>

<li>执行器
<ul class="org-ul">
<li>检查对表的执行权限。sql 执行过程中可能会有触发器这种在运行时才能确定的过程，分析器工作结束后的 precheck 是不能对这种运行时涉及到的表进行权限校验的，所以需要在执行器阶段进行权限检查。另外正是因为有 precheck 这个步骤，才会在报错时报的是用户无权，而不是 k 字段不存在（为了不向用户暴露表结构）</li>
<li>使用对应的引擎打开表。</li>
</ul></li>
</ul></li>

<li>存储引擎层</li>
</ul>
</div>
</div>

<div id="outline-container-org9284661" class="outline-2">
<h2 id="org9284661">日志系统：更新语句执行流程</h2>
<div class="outline-text-2" id="text-org9284661">
<p>
redo log：
</p>
<ul class="org-ul">
<li>更新数据，先写 redo log，空闲时间再写磁盘，即 WAL（write-ahead logging）技术。</li>
<li>固定大小，1GB/文件 * 4</li>
<li>保证及时数据库发生异常重启，之前提交的记录都不会丢失。</li>
<li>InnoDB 引擎特有日志</li>
<li>innodb_flush_log_at_trx_commit=1</li>
<li>redo log 是顺序写，记录落盘是随机写，前者要快很多所以先写 redo log，然后记录落盘。</li>
</ul>

<p>
binlog
</p>
<ul class="org-ul">
<li>server 层特有日志。</li>
<li>sync_binlog=1。</li>
<li>binlog 是有固定格式，也就是固定结尾的，可以用来判断一条 binlog 是否完整。</li>
</ul>

<p>
二者不同：
</p>
<ul class="org-ul">
<li>redo log 是 InnoDB 特有的。binlog 是 MySQL 层实现的，所有引擎都可以使用。</li>
<li>redo log 是物理日志，记录数据页的更改；binlog 是逻辑日志，记录 sql 语句的原始逻辑。二者通过事务 ID 进行对应。</li>
<li>redo log 是循环写的，binlog 是追加写。</li>
<li>redo log 用于异常重启恢复，binlog 主要用于备份。</li>
</ul>

<p>
update 语句二阶段提交。
</p>
<ul class="org-ul">
<li>执行器执行语句，获得新行，调用引擎接口。</li>
<li>引擎更新数据到内存，同时写操作记录到 redo log，redo log 处于 prepare 状态。</li>
<li>执行器执行 binlog，binlog 写磁盘。</li>
<li>执行器调用引擎提交事务接口，引擎将刚才的 redo log 改为提交状态。（prepare 写日志的最后 512 个字节，会在 commit 的时候被改掉）</li>
</ul>
</div>
</div>

<div id="outline-container-orgc642176" class="outline-2">
<h2 id="orgc642176">事务隔离</h2>
<div class="outline-text-2" id="text-orgc642176">
<p>
事务特性：ACID（Atomicity、Consistency、Isolation、Durability，即原子性、一致性、隔离性、持久性）。
</p>

<p>
隔离性常见问题：脏读、不可重复读、幻读
</p>

<p>
SQL 标准的事务隔离级别包括：
</p>
<ul class="org-ul">
<li>读未提交（read uncommitted），实现方式：直接返回记录上的值。</li>
<li>读提交（read committed），实现方式：开始执行 SQL 语句时候创建一致性视图。</li>
<li>可重复读（repeatable read），实现方式：启动事务时创建一致性视图。</li>
<li>串行化（serializable）,实现方式：加锁。</li>
</ul>

<p>
设置隔离级别：启动参数 transactio-isolation，查询 <code>show variables like 'transaction_isolation'</code>
</p>

<p>
事务实现原理-mvcc（多版本并发控制）：
</p>
<ul class="org-ul">
<li>每条记录在更新的时候都会同时记录一条回滚操作，即回滚日志。</li>
<li>当没有比回滚日志更早的 read-view 时候，才删除回滚日志。</li>
<li>同一条记录在系统中可以存在多个版本，即数据库的多版本并发控制。</li>
</ul>

<p>
不要使用长事务。
</p>
<ul class="org-ul">
<li>长事务意味着会存在很多老的事务视图，以及大量回滚日志。</li>
<li>长事务还会占用锁资源。</li>
</ul>

<p>
避免使用长事务：
</p>
<ul class="org-ul">
<li>总是设置 autocommit = 1，开启事务的自动提交。</li>
</ul>

<p>
查询 information_schema 的 innodb_trx 查找长事务：查找时间超过 60s 的长事务。
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a1db00;">select</span> * <span style="color: #a1db00;">from</span> information_schema.innodb_trx <span style="color: #a1db00;">where</span> TIME_TO_SEC(timediff(now(),trx_started))&gt;60
</pre>
</div>

<p>
如何避免长事务：
</p>
<ul class="org-ul">
<li>业务端：
<ul class="org-ul">
<li>确认是否使用了 set autocommit=0。</li>
<li>确认是否有不必要的只读事务。</li>
<li>业务连接数据库的时候，根据业务本身的预估，通过 SET MAX_EXECUTION_TIME 命令，来控制每个语句执行的最长时间，避免单个语句意外执行太长时间。</li>
</ul></li>
<li>数据端
<ul class="org-ul">
<li>监控 information_schema.Innodb_trx 表，设置长事务阈值，超过就报警或者 kill；</li>
<li>Percona 的 pt-kill 这个工具不错，推荐使用；</li>
<li>在业务功能测试阶段要求输出所有的 general_log，分析日志行为提前发现问题；</li>
<li>如果使用的是 MySQL 5.6 或者更新版本，把 innodb_undo_tablespaces 设置成 2（或更大的值）。如果真的出现大事务导致回滚段过大，这样设置后清理起来更方便。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org032edbc" class="outline-2">
<h2 id="org032edbc">深入浅出索引（上）</h2>
<div class="outline-text-2" id="text-org032edbc">
<p>
索引目的：加速查询效率。
</p>

<p>
索引模型：
</p>
<ul class="org-ul">
<li>哈希表，只适合等值查询，不适合区间查询。</li>
<li>有序数组，支持区间查询和等值查询，但是插入困难，只适合静态存储引擎。</li>
<li>二叉树：每个节点都是需要读取的数据库，每次随机读取都差不多需要 10ms，树高多次读取耗时过久。</li>
<li>B+树：
<ul class="org-ul">
<li>对磁盘读写少。</li>
<li>InnoDB 的 N 叉树大约是 1200。</li>
<li>B+树的叶子节点是 page，每个 page 里面存有多个行。每个页里面通过有序数组查找行。</li>
</ul></li>
</ul>

<p>
主键索引：
</p>
<ul class="org-ul">
<li>聚簇索引：索引和数据保存在一起，删除主键其实就是重建整张表。</li>
</ul>

<p>
非主键索引：
</p>
<ul class="org-ul">
<li>二级索引：</li>
</ul>

<p>
索引维护
</p>
<ul class="org-ul">
<li>页分裂</li>
<li>页合并</li>
</ul>

<p>
最佳实践：
</p>
<ul class="org-ul">
<li>使用自增字段做索引，减少页分裂和合并，一般建议设置成 bigint unsigned。</li>
<li>二级索引重建应该新建索引再做删除，如果有查询用到这个索引，此时索引已被删除，会导致业务抖动。</li>
<li>主键重建不能采用 drop 这种方式去按操作，因为所有数据都是以主键组织的，
<ul class="org-ul">
<li>删了主键后，InnoDB 会自己找一个主键组织数据，再次添加主键又会重新组织数据，重建表的次已达二次，我们可以直接 Optimiz 这个表。</li>
<li>第一个是整个数据库迁移，先 dump 出来再重建表（这个一般只适合离线的业务来做）。</li>
<li>第二个是用空的 alter 操作，比如 ALTER TABLE t1 ENGINE = InnoDB 或者 optimize table 原地重建表结构。</li>
<li>第三个是用 repaire table，不过这个是由存储引擎决定支不支持的（innodb 就不行）。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5a260d8" class="outline-2">
<h2 id="org5a260d8">深入浅出索引（下）</h2>
<div class="outline-text-2" id="text-org5a260d8">
<p>
覆盖索引：索引上存储的值可以满足查询需求（查询列和条件列），就不需要回表了。对于高频查询使用覆盖索引。
</p>

<p>
最左前缀原则。
</p>

<p>
索引下推：可以在索引便利过程中，对索引中包含的字段现做判断，直接过滤掉不满足条件的值。
</p>

<p>
Percona 工具包
</p>

<p>
二级索引会默认和主键索引做联合索引。
</p>

<p>
联合索引是依次按照联合字段的先后顺序，依次进行排序。如 a,b,c 三个字段是联合索引，则叶子节点存储的是三个字段的数据，且按照先后顺序进行排序；而非叶子节点存储的是第一个关键字的索引。故当执行查询的时候，因为联合索引中是先根据 a 进行排序的，如果 a 没有先确定，直接对 b 或 c 进行查询的话，就相当于是乱序查询，因此联合索引无法生效，此时就相当于是全表查询。
</p>
</div>
</div>

<div id="outline-container-org12e7345" class="outline-2">
<h2 id="org12e7345">全局锁和表锁</h2>
<div class="outline-text-2" id="text-org12e7345">
<p>
全局锁：整个数据库加锁（FTWRL）。
</p>
<ul class="org-ul">
<li>使用场景：全库逻辑备份。</li>
<li>mysqldump 使用 &#x2013;sing-transaction 启动事务，不用加全局锁。</li>
<li>这种方法与 read-only 的对比
<ul class="org-ul">
<li>read-only 可能用来判断主从库，而且对 super 权限无用。</li>
<li>全局锁连接断开后可能会自动释放。</li>
</ul></li>
</ul>

<p>
增删改数据（DML），修改表结构（DDL）。
</p>

<p>
表级锁：
</p>
<ul class="org-ul">
<li>表锁。</li>
<li>元数据锁（meta data lock， MDL），在访问表数据的时候自动加上。</li>
</ul>
</div>
</div>

<div id="outline-container-org421ce5c" class="outline-2">
<h2 id="org421ce5c">行锁功过：怎么减少行锁对性能的影响</h2>
<div class="outline-text-2" id="text-org421ce5c">
<p>
全局锁和表锁是在 server 层实现的，行锁是在引擎自己实现的。
</p>

<p>
两阶段锁协议：
</p>
<ul class="org-ul">
<li>在 InnoDB <b>事务</b> 中，行锁是在需要的时候才加上的，但并不是不需要了就立刻释放，而是要等到事务结束才会释放。</li>
<li>实践：如果事务中需要锁多个行，要把最可能造成锁冲突、最可能影响并发度的锁尽量往后放。</li>
</ul>

<p>
死锁处理策略：
</p>
<ul class="org-ul">
<li>直接等待，直到超时，超时时间通过 innodb_lock_wait_timeout 设置。
<ul class="org-ul">
<li>缺点：如何合理设置超时时间，太短可能是锁等待，又不能太长。</li>
</ul></li>
<li>死锁检测，主动回滚。
<ul class="org-ul">
<li>实践：合理设计事务中的语句顺序，避免语句造成的死锁。</li>
<li>缺点：每个阻塞的进程都要进行死锁检测，会消耗时间。</li>
</ul></li>
</ul>

<p>
热点行更新，导致死锁检测耗时过久：
</p>
<ul class="org-ul">
<li>控制并发度。</li>
<li>将一行改成逻辑上的几行。</li>
</ul>


<p>
  InnoDB 行锁是通过给索引上的索引项加锁来实现的，这一点 MySQL 与 Oracle 不同，后者是通过在数据块中对相应数据行加锁来实现的。 InnoDB 这种行锁实现特点意味着：只有通过索引条件检索数据，InnoDB 才使用行级锁，否则，InnoDB 将使用表锁！
在实际应用中，要特别注意 InnoDB 行锁的这一特性，不然容易导致大量的锁冲突，从而影响并发性能。
</p>
</div>
</div>

<div id="outline-container-orga39e1f0" class="outline-2">
<h2 id="orga39e1f0">事务到底是隔离的还是不隔离的？</h2>
<div class="outline-text-2" id="text-orga39e1f0">
<p>
事务启动方式：
</p>
<ul class="org-ul">
<li>begin/start transaction: 执行第一个快照语句时创建一致性读视图。</li>
<li>start transaction with cosistent snapshot：立马创建一致性读视图。</li>
</ul>

<p>
InnoDB 通过 MVCC 实现秒级创建快照（一致性视图）：
</p>
<ul class="org-ul">
<li>每个事务都有一个数组，用来保存启动事务瞬间，当前正在 <b>活跃</b> 的所有事务 ID。活跃是指启动了但是没有提交。</li>
<li>更新数据都是先读后写，读只能读当前值，这种行为称为“当前读”。</li>
</ul>


<p>
select 使用 lock in share mode 或者 for update，支持当前读。
</p>

<p>
可重复读的核心就是一致性读。
</p>
</div>
</div>

<div id="outline-container-orgfd954d0" class="outline-2">
<h2 id="orgfd954d0">普通索引和唯一索引，应该怎么选择</h2>
<div class="outline-text-2" id="text-orgfd954d0">
<p>
普通索引和唯一索引在查询能力上没有差别，主要是对更新性能的影响。
</p>


<p>
如果数据不在内存中：
</p>
<ul class="org-ul">
<li>普通索引：将记录更新在 change buffer 中。</li>
<li>唯一索引：从磁盘读取数据，判断唯一性。</li>
</ul>

<p>
change buffer 中的数据在读取数据、后台更新、关闭 mysql 时候落盘。
</p>

<p>
普通索引可以使用 change buffer 加快更新流程，建议尽量使用普通索引。
</p>

<p>
对于写多读少的业务，change buffer 的使用效果最好。
</p>


<p>
change buffer 和 redo log 区别：
</p>
<ul class="org-ul">
<li>change buffer 是减少随机读磁盘的 IO。</li>
<li>redo log 是将随机写变为顺序写，减少随机写磁盘的 IO。</li>
</ul>
</div>
</div>

<div id="outline-container-org90f60cc" class="outline-2">
<h2 id="org90f60cc">mysql 为什么有时候会选错索引</h2>
<div class="outline-text-2" id="text-org90f60cc">
<p>
优化器会结合扫描行数、是否使用临时表、是否排序等因素进行综合判断。
</p>

<p>
根据索引的区分度来判断索引上的值有多少，这是一个统计信息，不是很准确。
</p>

<p>
索引异常处理办法：
</p>
<ul class="org-ul">
<li>使用 analyze table 命令重新统计索引信息。</li>
<li>使用 force index 强制选择索引。</li>
<li>修改语句，引导 mysql 使用期望的索引。</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb4fa36" class="outline-2">
<h2 id="orgeb4fa36">怎么给字符串字段加索引</h2>
<div class="outline-text-2" id="text-orgeb4fa36">
<p>
使用前缀索引可以减少索引长度。
</p>

<p>
如何选择字符串前缀索引长度：
</p>
<ul class="org-ul">
<li>通过字符串不同长度的前缀区分度来判断。</li>
</ul>


<p>
前缀索引不能使用覆盖索引对查询性能的优化。
</p>

<p>
前缀区分度低怎么办？
</p>
<ul class="org-ul">
<li>倒序存储 reverse()</li>
<li>hash crc32()</li>
</ul>
</div>
</div>

<div id="outline-container-org419167d" class="outline-2">
<h2 id="org419167d">为什么我的 mysql 会抖一下</h2>
<div class="outline-text-2" id="text-org419167d">
<p>
可能是在写内存和刷脏页。
redo log 何时写：
</p>
<ul class="org-ul">
<li>redo log 满了</li>
<li>系统内存不足，需要淘汰数据页，而数据也恰好是脏页。</li>
<li>系统空闲。</li>
<li>mysql 关闭。</li>
</ul>


<p>
InnoDB 刷脏页的控制策略：
</p>
<ul class="org-ul">
<li><p>
磁盘速度：设置 innodb_io_capacity 参数
</p>
<div class="org-src-container">
<pre class="src src-sh">fio -filename=$<span style="color: #ff8700;">filename</span> -direct=1 -iodepth 1 -thread -rw=randrw -ioengine=psync -bs=16k -size=500M -numjobs=10 -runtime=10 -group_reporting -name=mytest
</pre>
</div></li>
<li>脏页比例：innodb_max_dirty_page_pct</li>
<li>相邻脏页 innodb_flush_neghbors</li>
</ul>
</div>
</div>

<div id="outline-container-orgcebfc33" class="outline-2">
<h2 id="orgcebfc33">为什么表数据删掉一半，表文件大小不变</h2>
<div class="outline-text-2" id="text-orgcebfc33">
<p>
innodb_file_per_table=ON
</p>

<p>
数据页的复用与记录的复用是不同的：
</p>
<ul class="org-ul">
<li>记录的复用，只限于符合范围条件的数据。</li>
<li>整个页从 B+树里里面摘掉以后，可以复用到任何位置。</li>
</ul>


<p>
delete 命令其实只是把记录的 位置，或者数据页标记为“可复用”，但是磁盘的大小是不会变的。
</p>

<p>
插入数据也会造成数据空洞。
</p>

<p>
重建表可以用来收缩表空间。alter table A engine=InnoDB.
</p>

<p>
推荐使用 github 开源的 gh-ost 操作。
</p>

<p>
Online 与 Inplace：
</p>

<ul class="org-ul">
<li>Inplace 是指数据有没有在表间移动。</li>
<li>Online 是指操作期间是否可以继续更新数据。</li>
<li>DDL 过程如果是 Online 的，那一定是 inplace 的。</li>
<li>反过来未必，截止到 mysql 8.0，添加全文索引和空间索引属于这种情况。</li>
</ul>
</div>
</div>

<div id="outline-container-org3c97d28" class="outline-2">
<h2 id="org3c97d28">count(*)这么慢，我该怎么办</h2>
<div class="outline-text-2" id="text-org3c97d28">
<p>
数据库保存技术：利用事务的特性自己实现
count(*)和 count(column)区别：
</p>
<ul class="org-ul">
<li>count(*) 做了特殊优化，不取值，直接返回行数，建议使用。</li>
<li>count(column) 返回列不为 null 的数量。</li>
</ul>
</div>
</div>

<div id="outline-container-org214c4bf" class="outline-2">
<h2 id="org214c4bf">答疑文章（一）：日志和索引相关问题</h2>
</div>

<div id="outline-container-org39a00d5" class="outline-2">
<h2 id="org39a00d5">order by 是怎么工作的</h2>
</div>

<div id="outline-container-org481b3ea" class="outline-2">
<h2 id="org481b3ea">如何正确的显示随机消息</h2>
</div>

<div id="outline-container-org4dcd172" class="outline-2">
<h2 id="org4dcd172">为什么这些 sql 语句逻辑相同，性能却差异巨大？</h2>
</div>

<div id="outline-container-org23be924" class="outline-2">
<h2 id="org23be924">为什么我只查一行的语句，也执行这么慢</h2>
</div>

<div id="outline-container-orge1e10af" class="outline-2">
<h2 id="orge1e10af">幻读是什么，幻读有什么问题</h2>
</div>

<div id="outline-container-org7e57275" class="outline-2">
<h2 id="org7e57275">mysql 有哪些“饮鸩止渴”提高性能的方法</h2>
</div>

<div id="outline-container-org1acbf95" class="outline-2">
<h2 id="org1acbf95">mysql 是怎么保证数据不丢的</h2>
</div>

<div id="outline-container-org5526be8" class="outline-2">
<h2 id="org5526be8">mysql 是怎么保证主备一致的</h2>
</div>

<div id="outline-container-orge8b60a8" class="outline-2">
<h2 id="orge8b60a8">mysql 是怎么保证高可用的</h2>
</div>

<div id="outline-container-org46dbae2" class="outline-2">
<h2 id="org46dbae2">备库为什么会延迟好几个小时</h2>
</div>

<div id="outline-container-org2168a86" class="outline-2">
<h2 id="org2168a86">主库出问题了，从库怎么办？</h2>
</div>

<div id="outline-container-org2f98d61" class="outline-2">
<h2 id="org2f98d61">读写分离哟那些坑</h2>
</div>

<div id="outline-container-orgc981b72" class="outline-2">
<h2 id="orgc981b72">如何判断一个数据库是不是出问题了</h2>
</div>

<div id="outline-container-org3b228af" class="outline-2">
<h2 id="org3b228af">答疑文章（二）：用动态的观点看加锁</h2>
</div>

<div id="outline-container-org25e55c6" class="outline-2">
<h2 id="org25e55c6">误删数据后除了跑路还能怎么办？</h2>
</div>

<div id="outline-container-orga589e88" class="outline-2">
<h2 id="orga589e88">为什么还有 kill 不掉的语句</h2>
</div>

<div id="outline-container-orgcc6e290" class="outline-2">
<h2 id="orgcc6e290">我查了这么多数据会不会把数据库内存打爆</h2>
</div>

<div id="outline-container-org938aa36" class="outline-2">
<h2 id="org938aa36">到底可不可以使用 join</h2>
</div>

<div id="outline-container-orgf8ce9db" class="outline-2">
<h2 id="orgf8ce9db">join 语句如何优化。</h2>
</div>

<div id="outline-container-orgfd22144" class="outline-2">
<h2 id="orgfd22144">为什么临时表可以重名</h2>
</div>

<div id="outline-container-orgc81829a" class="outline-2">
<h2 id="orgc81829a">什么时候会使用内部临时表</h2>
</div>

<div id="outline-container-org4faf949" class="outline-2">
<h2 id="org4faf949">都说 InnoDB 好，那还要不要使用 Memory 引擎</h2>
</div>

<div id="outline-container-orgfc30ba3" class="outline-2">
<h2 id="orgfc30ba3">自增主键为什么不是连续的</h2>
</div>

<div id="outline-container-orgad96f0b" class="outline-2">
<h2 id="orgad96f0b">insert 语句的锁为什么这么多</h2>
</div>

<div id="outline-container-orgabfcfe5" class="outline-2">
<h2 id="orgabfcfe5">怎么最快的赋值一张表</h2>
</div>

<div id="outline-container-orgcb95bc6" class="outline-2">
<h2 id="orgcb95bc6">grant 之后为什么要跟着 flush privilege</h2>
</div>

<div id="outline-container-org5f1669e" class="outline-2">
<h2 id="org5f1669e">要不要使用分区表</h2>
</div>

<div id="outline-container-org0259050" class="outline-2">
<h2 id="org0259050">答疑文章（三）说一说这些好问题</h2>
</div>

<div id="outline-container-orgb3ae6ab" class="outline-2">
<h2 id="orgb3ae6ab">自增 ID 用完了怎么办</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="validation"></p>
</div>
</body>
</html>
